# Pandas 2

Adding columns, deleting columns, and slicing the data

In [1]:
import pandas as pd

In [2]:
col1 = [100,200]  # a list
col2=["M","F"]
col3=["Tin","Esther"]

# a dictionary
data = { "c1" : col1,
         "c2" : col2,
         "c3" : col3 
       }

# Create dataframe
df = pd.DataFrame(data)
df.columns = ["col1", "col2", "col3"]
df

   col1 col2    col3
0   100    M     Tin
1   200    F  Esther

In [3]:
def myfunction(x):
    if x == "M":
        return "Male"
    else:
        return "Female"
    
df["col2_full"] = df.col2.apply(myfunction)
df

   col1 col2    col3 col2_full
0   100    M     Tin      Male
1   200    F  Esther    Female

In [4]:
del df["col2_full"]
df

   col1 col2    col3
0   100    M     Tin
1   200    F  Esther

In [5]:
df['NewCol'] =6
df

   col1 col2    col3  NewCol
0   100    M     Tin       6
1   200    F  Esther       6

In [6]:
del df['NewCol']
df

   col1 col2    col3
0   100    M     Tin
1   200    F  Esther

In [7]:
df.index  # index (row labels) of the DataFrame.

RangeIndex(start=0, stop=2, step=1)

In [8]:
i = ['a' , 'b']
df.index = i  # change the name of the index                
df.columns =["Credit","Gender", "Name"] # change the name of the column
df

   Credit Gender    Name
a     100      M     Tin
b     200      F  Esther

In [9]:
# iloc - integer-location based indexing for selection by position
df.iloc [0]   #  row 0

Credit    100
Gender      M
Name      Tin
Name: a, dtype: object

In [10]:
df.iloc[0,1] # row 0, column 1

'M'

In [11]:
df.iloc[:2]  # slicing  - row 0 to row 1

   Credit Gender    Name
a     100      M     Tin
b     200      F  Esther

In [12]:
df.iloc[:2, :]  # slicing  - row 0 to row 1

   Credit Gender    Name
a     100      M     Tin
b     200      F  Esther

In [13]:
df.iloc[:2, 1:3]  # slicing  - row 0 to row 1, column 1 to 2

  Gender    Name
a      M     Tin
b      F  Esther

In [14]:
df.iloc[:5, 1:5] # slice indexers which allow out-of-bounds indexing

  Gender    Name
a      M     Tin
b      F  Esther

In [15]:
df.loc['a':'b']  # loc - access by label(s). Note: iloc - is integer-based access

   Credit Gender    Name
a     100      M     Tin
b     200      F  Esther

In [16]:
df.loc['a':'d']

   Credit Gender    Name
a     100      M     Tin
b     200      F  Esther

In [17]:
df[['Credit', 'Gender']]

   Credit Gender
a     100      M
b     200      F

In [18]:
df.head()

   Credit Gender    Name
a     100      M     Tin
b     200      F  Esther

In [19]:
df.tail()

   Credit Gender    Name
a     100      M     Tin
b     200      F  Esther